Repository: achappey/aihappey-windows
Catalog: Core/AIHappey.Desktop.Core/Strings/*/Resources.resw
Source language: en
Languages: nl

source: Settings
nl: Instellingen

source: General
nl: Algemeen

source: Attachments
nl: Bijlagen

source: Language
nl: Taal

source: Save
nl: Opslaan

source: Cancel
nl: Annuleren

source: Close
nl: Sluiten

# SystemContext
source: System
nl: Systeem

source: User
nl: Gebruiker

source: Context part
nl: Contextonderdeel

# SystemInstructions
source: Custom instructions
nl: Aangepaste instructies

# SystemInstructionsHint
source: Added as a separate system-context part for model chat. App instructions remain controlled by the app distributor.
nl: Toegevoegd als afzonderlijk systeemcontextonderdeel voor modelchat. App-instructies blijven beheerd door de app-distributeur.

# AgentContextOmitted
source: This app context is not sent in agent mode, matching the browser chat experience. Agent instructions are managed by the service.
nl: Deze app-context wordt niet verzonden in agentmodus, net als in de browserchat. Agent-instructies worden beheerd door de service.

source: Add
nl: Toevoegen

source: Remove
nl: Verwijderen

source: Delete
nl: Verwijderen

source: Rename
nl: Naam wijzigen

source: Refresh
nl: Vernieuwen

source: Stop
nl: Stoppen

source: Retry
nl: Opnieuw proberen

source: Show more
nl: Meer tonen

# Welcome
source: Your helpful replacement has arrived
nl: Je behulpzame vervanger is er

# Disclaimer
source: AI can make mistakes. Check important information.
nl: AI kan fouten maken. Controleer belangrijke informatie.

source: Generated by AI
nl: Door AI gegenereerd

# GeneratedByAiWarning
source: AI-generated content may be incorrect
nl: Door AI gegenereerde inhoud is mogelijk onjuist

# TimeJustNow
source: Just now
nl: Zojuist

# TimeMinuteAgo
source: One minute ago
nl: Eén minuut geleden

# TimeMinutesAgo
source: {0} minutes ago
nl: {0} minuten geleden

# TimeHourAgo
source: One hour ago
nl: Eén uur geleden

# TimeHoursAgo
source: {0} hours ago
nl: {0} uur geleden

# TimeDayAgo
source: One day ago
nl: Eén dag geleden

# TimeDaysAgo
source: {0} days ago
nl: {0} dagen geleden

# TimeWeekAgo
source: One week ago
nl: Eén week geleden

# TimeWeeksAgo
source: {0} weeks ago
nl: {0} weken geleden

# TimeMonthAgo
source: One month ago
nl: Eén maand geleden

# TimeMonthsAgo
source: {0} months ago
nl: {0} maanden geleden

# TimeYearAgo
source: One year ago
nl: Eén jaar geleden

# TimeYearsAgo
source: {0} years ago
nl: {0} jaar geleden

source: Ask anything
nl: Vraag maar raak

source: Models
nl: Modellen

# SelectModel
source: Select a model
nl: Selecteer een model

# SelectAgent
source: Select an existing agent
nl: Selecteer een bestaande agent

source: New chat
nl: Nieuwe chat

source: User profile
nl: Gebruikersprofiel

source: Send message
nl: Bericht verzenden

source: Message
nl: Bericht

# InputHelp
source: Enter to send. Shift+Enter for a new line.
nl: Enter om te verzenden. Shift+Enter voor een nieuwe regel.

source: Connection settings
nl: Endpointinstellingen

# RefreshTargets
source: Refresh models or agents
nl: Modellen of agents vernieuwen

# RefreshAgents
source: Refresh agent overview
nl: Agentoverzicht vernieuwen

# RefreshSkills
source: Refresh skill overview
nl: Skilloverzicht vernieuwen

source: Working…
nl: Bezig…

source: Dismiss
nl: Sluiten

# ToggleHistory
source: Toggle chat history
nl: Chatgeschiedenis tonen of verbergen

source: Manage account
nl: Account beheren

source: Sign in
nl: Inloggen

source: Sign in again
nl: Opnieuw inloggen

source: Sign out
nl: Uitloggen

source: API keys
nl: API-sleutels

source: API key
nl: API-sleutel

source: You
nl: Jij

source: Reasoning
nl: Redenering

source: Tool activity
nl: Toolactiviteit

source: Input
nl: Invoer

source: Streaming input
nl: Streaminginvoer

# Approval
source: Approval (not sent by desktop)
nl: Goedkeuring (niet verzonden door desktop)

source: Error
nl: Fout

source: Warning
nl: Waarschuwing

source: Success
nl: Geslaagd

source: Information
nl: Informatie

source: Previous activity
nl: Vorige activiteit

source: Next activity
nl: Volgende activiteit

# ActivityList
source: Show activity list
nl: Activiteitenlijst tonen

# AttachmentsSources
source: Attachments and sources
nl: Bijlagen en bronnen

source: Copy message
nl: Bericht kopiëren

source: Rename chat
nl: Chatnaam wijzigen

source: Delete chat?
nl: Chat verwijderen?

# DeleteChatHint
source: This removes the local conversation permanently.
nl: Hiermee wordt de lokale chat definitief verwijderd.

# NoTargets
source: The service is ready but no targets are available. Configure API keys or install agent definitions.
nl: De service is gereed, maar er zijn geen modellen of agents beschikbaar. Stel API-sleutels in of installeer agentdefinities.

# SelectTarget
source: Select a target from the model or agent catalog.
nl: Selecteer een model of agent uit de catalogus.

# StreamInterrupted
source: The stream ended before completion. Partial output was kept.
nl: De stream is voortijdig beëindigd. Gedeeltelijke uitvoer is bewaard.

# HistorySaveFailed
source: Chat history could not be saved. The conversation remains available until the app closes.
nl: De chatgeschiedenis kon niet worden opgeslagen. De chat blijft beschikbaar totdat de app wordt gesloten.

# ClipboardUnavailable
source: The clipboard is currently unavailable.
nl: Het klembord is momenteel niet beschikbaar.

# OperationCanceled
source: Operation canceled or timed out.
nl: De bewerking is geannuleerd of de tijdslimiet is verstreken.

# OperationFailed
source: The operation failed. Check service availability, settings, and local storage permissions.
nl: De bewerking is mislukt. Controleer de beschikbaarheid van de service, de instellingen en de toegangsrechten voor lokale opslag.

source: Search chats
nl: Chats zoeken

source: Search conversations
nl: Chats doorzoeken

# SearchConversationsPlaceholder
source: Search conversations…
nl: Chats doorzoeken…

source: Chat actions
nl: Chatacties

source: Recent chats
nl: Recente chats

source: Searching…
nl: Zoeken…

source: No recent chats.
nl: Geen recente chats.

source: No results.
nl: Geen resultaten.

source: Activity
nl: Activiteit

source: Sources
nl: Bronnen

source: All sources
nl: Alle bronnen

source: Close details
nl: Details sluiten

source: Copy source
nl: Bron kopiëren

# OpenSource
source: Open source in browser
nl: Bron openen in browser

# SourceOpenFailed
source: The source could not be opened.
nl: De bron kon niet worden geopend.

source: Download
nl: Downloaden

# BrowserResourceHint
source: This resource needs browser or MCP access. Its reference is retained in the conversation.
nl: Deze bron vereist browser- of MCP-toegang. De verwijzing blijft bewaard in de chat.

source: Attachment downloaded.
nl: Bijlage gedownload.

# DownloadCanceled
source: The download was canceled or timed out.
nl: De download is geannuleerd of de tijdslimiet is verstreken.

# DownloadFailed
source: The attachment could not be downloaded. Check the destination and network connection.
nl: De bijlage kon niet worden gedownload. Controleer de bestemming en de netwerkverbinding.

source: Add context
nl: Context toevoegen

# PublicUrl
source: URL (publicly accessible)
nl: URL (openbaar toegankelijk)

source: Custom MIME type
nl: Aangepast MIME-type

# DetectingMime
source: Detecting MIME type…
nl: MIME-type bepalen…

# MimeNotDetected
source: MIME type could not be detected. Select the type of content at this URL.
nl: Het MIME-type kon niet worden bepaald. Selecteer het type inhoud op deze URL.

# InvalidPublicUrl
source: Enter a valid HTTP or HTTPS URL without credentials.
nl: Voer een geldige HTTP- of HTTPS-URL zonder inloggegevens in.

# InvalidMime
source: Enter a valid MIME type, for example application/pdf.
nl: Voer een geldig MIME-type in, bijvoorbeeld application/pdf.

source: Custom
nl: Aangepast

# SearchPlaceholder
source: Search…
nl: Zoeken…

source: Search agents
nl: Agents zoeken

source: Search skills
nl: Skills zoeken

# AgentsDescription
source: Agents bring capabilities, context, and execution logic together in a single model. Explore the available agents and choose one to start a conversation.
nl: Agents combineren mogelijkheden, context en uitvoeringslogica in één model. Ontdek de beschikbare agents en kies er een om een chat te starten.

# SkillsDescription
source: An overview of available skills for tasks and workflows. See what each skill does and choose the right option. Skills combine instructions, logic, and execution in a consistent structure.
nl: Een overzicht van beschikbare skills voor taken en workflows. Bekijk wat elke skill doet en kies de juiste optie. Skills combineren instructies, logica en uitvoering in een consistente structuur.

source: Loading…
nl: Laden…

# CatalogNoResults
source: No results. Try another search or filter.
nl: Geen resultaten. Probeer een andere zoekopdracht of filter.

# CatalogCanceled
source: Catalog loading was canceled or timed out.
nl: Het laden van de catalogus is geannuleerd of de tijdslimiet is verstreken.

# CatalogFailed
source: The catalog could not be loaded. Check your connection, account, and local storage permissions.
nl: De catalogus kon niet worden geladen. Controleer je verbinding, account en toegangsrechten voor lokale opslag.

# AgentUnavailable
source: This agent is no longer available. Refresh the agent overview.
nl: Deze agent is niet meer beschikbaar. Vernieuw het agentoverzicht.

# VersionsCanceled
source: Version loading was canceled or timed out.
nl: Het laden van versies is geannuleerd of de tijdslimiet is verstreken.

# VersionsFailed
source: Skill versions could not be loaded. You can still download the default version.
nl: De skillversies konden niet worden geladen. Je kunt nog steeds de standaardversie downloaden.

source: Agent definition
nl: Agentdefinitie

# SkillArchive
source: Skill ZIP archive
nl: ZIP-archief van skill

# AgentDownloaded
source: Agent definition downloaded.
nl: Agentdefinitie gedownload.

# SkillDownloaded
source: Skill archive downloaded. It has not been installed or enabled.
nl: Skillarchief gedownload. Het is niet geïnstalleerd of ingeschakeld.

source: Add favorite
nl: Favoriet toevoegen

source: Remove favorite
nl: Favoriet verwijderen

source: Start chat
nl: Chat starten

source: Instructions
nl: Instructies

source: Definition
nl: Definitie

source: Versions
nl: Versies

source: Instructions (read-only)
nl: Instructies (alleen-lezen)

# InstructionsUnavailable
source: The backend does not expose instructions for this agent.
nl: De backend biedt geen instructies voor deze agent aan.

source: Definition (read-only)
nl: Definitie (alleen-lezen)

# DefinitionNotExposed
source: The backend does not expose this agent's definition. Definition download is unavailable.
nl: De backend biedt de definitie van deze agent niet aan. De definitie kan niet worden gedownload.

source: Download definition
nl: Definitie downloaden

# DownloadDefault
source: Download default version
nl: Standaardversie downloaden

# SkillDownloadHint
source: Downloading saves a ZIP file only. It does not install or enable this skill.
nl: Bij het downloaden wordt alleen een ZIP-bestand opgeslagen. De skill wordt niet geïnstalleerd of ingeschakeld.

source: Definition unavailable
nl: Definitie niet beschikbaar

# DefinitionUnavailableHint
source: You can chat with this agent, but its backend does not expose a downloadable definition.
nl: Je kunt met deze agent chatten, maar de backend biedt geen downloadbare definitie aan.

source: Loading versions…
nl: Versies laden…

source: Versions unavailable
nl: Versies niet beschikbaar

# NoVersions
source: No versions are available.
nl: Er zijn geen versies beschikbaar.

source: Default
nl: Standaard

source: Latest
nl: Nieuwste

# InvalidDataUrl
source: The attachment contains an invalid data URL.
nl: De bijlage bevat een ongeldige data-URL.

# DownloadLimit
source: This attachment exceeds the 64 MB download limit.
nl: Deze bijlage overschrijdt de downloadlimiet van 64 MB.

# InvalidBinary
source: The attachment contains invalid binary data.
nl: De bijlage bevat ongeldige binaire gegevens.

# ResourceDownloadUnsupported
source: This resource requires browser or MCP access and cannot be downloaded by desktop yet.
nl: Deze bron vereist browser- of MCP-toegang en kan nog niet worden gedownload door de desktopapp.

# AttachmentFilenameRequired
source: An attachment needs a filename.
nl: Een bijlage moet een bestandsnaam hebben.

# InvalidUrlOrType
source: Invalid URL or media type.
nl: Ongeldige URL of ongeldig mediatype.

# AttachmentLimit
source: The attachment exceeds the 25 MB per-file limit.
nl: De bijlage overschrijdt de limiet van 25 MB per bestand.

# MessageRequired
source: Add a message, attachment, or link before sending.
nl: Voeg een bericht, bijlage of link toe voordat je verzendt.

# PdfAttachmentLimit
source: The PDF exceeds the attachment limit.
nl: De PDF overschrijdt de bijlagelimiet.

# PdfPageLimit
source: The PDF exceeds the text extraction page limit.
nl: De PDF overschrijdt de paginalimiet voor tekstextractie.

# PdfTextLimit
source: The PDF exceeds the text extraction limit.
nl: De PDF overschrijdt de limiet voor tekstextractie.

# RemoteOnly
source: This host only supports remote gateways.
nl: Deze app ondersteunt alleen externe gateways.

# InvalidRemoteUrl
source: Remote gateways must use an absolute HTTPS URL without credentials, query, or fragment; loopback is reserved for managed local mode.
nl: Externe gateways moeten een absolute HTTPS-URL zonder inloggegevens, query of fragment gebruiken; loopback is gereserveerd voor de beheerde lokale modus.

# SettingsReadFailed
source: Desktop settings could not be read. Restore or remove the settings file in the desktop data directory.
nl: De desktopinstellingen konden niet worden gelezen. Herstel of verwijder het instellingenbestand in de desktopgegevensmap.

# InvalidSkillIdentifier
source: This skill identifier does not support gateway content or version requests.
nl: Deze skill-ID ondersteunt geen aanvragen voor gatewayinhoud of versies.

# InvalidSkillVersion
source: The service returned an unsupported skill version.
nl: De service heeft een niet-ondersteunde skillversie teruggegeven.

# InvalidCatalogContinuation
source: The service returned an invalid catalog continuation.
nl: De service heeft een ongeldige catalogusvervolgpagina teruggegeven.

# CatalogPageLimit
source: The catalog exceeded the supported page limit.
nl: De catalogus overschrijdt de ondersteunde paginalimiet.

# SkillZipRequired
source: The service did not return a skill ZIP archive.
nl: De service heeft geen ZIP-archief van een skill teruggegeven.

# InvalidSkillArchive
source: The service returned invalid skill archive content.
nl: De service heeft ongeldige inhoud voor een skillarchief teruggegeven.

# InvalidCatalogDocument
source: The service returned an invalid catalog document.
nl: De service heeft een ongeldig catalogusdocument teruggegeven.

# InvalidCatalogList
source: The service returned an invalid catalog list.
nl: De service heeft een ongeldige cataloguslijst teruggegeven.

# ResponseSizeLimit
source: The service response exceeded the supported size.
nl: Het antwoord van de service overschrijdt de ondersteunde grootte.

# UnsupportedFavorites
source: The saved catalog favorites format is unsupported.
nl: De indeling van de opgeslagen catalogusfavorieten wordt niet ondersteund.

# InvalidFavoritesPartition
source: Invalid catalog favorites partition.
nl: Ongeldige partitie voor catalogusfavorieten.

# InvalidModelCatalog
source: The service returned an invalid model catalog.
nl: De service heeft een ongeldige modelcatalogus teruggegeven.

# ChatStreamRequired
source: The service did not return a chat event stream.
nl: De service heeft geen chatgebeurtenisstream teruggegeven.

# StreamSizeLimit
source: A stream event exceeded the supported size.
nl: Een streamgebeurtenis overschrijdt de ondersteunde grootte.

# GenerationError
source: The service reported a generation error. Check credentials and model availability. Partial output has been kept.
nl: De service heeft een generatiefout gemeld. Controleer je inloggegevens en de beschikbaarheid van het model. Gedeeltelijke uitvoer is bewaard.

# ApprovalUnsupported
source: This agent requires tool approval, which is not supported yet. No approval was sent.
nl: Deze agent vereist toolgoedkeuring, die nog niet wordt ondersteund. Er is geen goedkeuring verzonden.

source: Invalid history partition.
nl: Ongeldige geschiedenisp artitie.

source: Invalid conversation ID.
nl: Ongeldige chat-ID.

# ApiKeysReadFailed
source: The protected API-key store could not be read. Restore or remove credentials.bin in the HeaderAuth data directory.
nl: De beveiligde API-sleutelopslag kon niet worden gelezen. Herstel of verwijder credentials.bin in de gegevensmap HeaderAuth.

# InvalidProviderHeaders
source: Use valid X- provider header names and non-empty, single-line API keys.
nl: Gebruik geldige X- providerheadernamen en niet-lege API-sleutels op één regel.

# ApiKeysHint
source: Keys are protected for your Windows account. They are sent as HTTP headers to the selected local or remote gateways. Add the provider's exact header name, for example X-OpenAI-Key or X-Anthropic-Key. No keys are included in chat history.
nl: Sleutels worden beveiligd voor je Windows-account. Ze worden als HTTP-headers naar de geselecteerde lokale of externe gateways verzonden. Voeg de exacte headernaam van de provider toe, bijvoorbeeld X-OpenAI-Key of X-Anthropic-Key. Sleutels worden niet opgenomen in de chatgeschiedenis.

source: Add provider key
nl: Providersleutel toevoegen

source: Provider API keys
nl: API-sleutels van providers

# UniqueProviderHeaders
source: Provider header names must be unique.
nl: Providerheadernamen moeten uniek zijn.

# EnterpriseConfigurationRequired
source: Configure desktop.json with your Entra tenant ID, desktop public-client ID, and gateway scopes, then restart the app.
nl: Stel desktop.json in met je Entra-tenant-ID, desktop-public-client-ID en gatewayscopes en start de app opnieuw.

# TokenCacheReadFailed
source: The protected Entra cache cannot be read. Restore or remove tokens.bin in the AzureAuth data directory.
nl: De beveiligde Entra-cache kan niet worden gelezen. Herstel of verwijder tokens.bin in de gegevensmap AzureAuth.

# EnterpriseDestinationRejected
source: This destination is not approved by the enterprise host configuration. Update desktop.json and restart to change gateways.
nl: Deze bestemming is niet goedgekeurd in de bedrijfsconfiguratie. Werk desktop.json bij en start opnieuw om gateways te wijzigen.

# EnterpriseSignInRequired
source: Sign in with your enterprise account using the account button.
nl: Log via de accountknop in met je bedrijfsaccount.

# InteractiveSignInRequired
source: Your account needs interactive authentication or consent. Use the account button to sign in again.
nl: Je account vereist interactieve verificatie of toestemming. Gebruik de accountknop om opnieuw in te loggen.

# TokenAcquisitionFailed
source: Entra token acquisition failed. Check the desktop registration, gateway scopes, and tenant policy.
nl: Het ophalen van een Entra-token is mislukt. Controleer de desktopregistratie, gatewayscopes en het tenantbeleid.

source: Enterprise account
nl: Bedrijfsaccount

# EnterpriseSignInHint
source: Sign in through your system browser. No client secret or provider API key is stored in this application.
nl: Log in via je systeembrowser. Deze app slaat geen clientgeheim of API-sleutel van een provider op.

# SameEnterpriseAccount
source: Use the same enterprise account for both services.
nl: Gebruik hetzelfde bedrijfsaccount voor beide services.

# EnterpriseSignInFailed
source: Entra sign-in failed or was canceled. Check your desktop registration, consent, and tenant policy.
nl: Het inloggen bij Entra is mislukt of geannuleerd. Controleer je desktopregistratie, toestemming en tenantbeleid.

# TokenUsage
source: Token usage: {0}
nl: Tokengebruik: {0}

# ChatActionsFor
source: Chat actions for {0}
nl: Chatacties voor {0}

# RemoveContext
source: Remove {0}
nl: {0} verwijderen

# OpenConversation
source: Open conversation: {0}
nl: Chat openen: {0}

# ConversationCount
source: {0}{1} conversations
nl: {0}{1} chats

# ConversationCountOne
source: {0} conversation
nl: {0} chat

# MessageSummary
source: {0} messages · {1:g}
nl: {0} berichten · {1:g}

# MessageSummaryOne
source: {0} message · {1:g}
nl: {0} bericht · {1:g}

# AllCount
source: All ({0})
nl: Alle ({0})

# FavoritesCount
source: Favorites ({0})
nl: Favorieten ({0})

# LocalCount
source: Local ({0})
nl: Lokaal ({0})

# NoAgents
source: No agents are available from this service. Check your connections and provider configuration.
nl: Er zijn geen agents beschikbaar bij deze service. Controleer je endpoints en providerconfiguratie.

# NoSkills
source: No skills are available from this service. Check your connections and provider configuration.
nl: Er zijn geen skills beschikbaar bij deze service. Controleer je endpoints en providerconfiguratie.

# DefaultVersion
source: Default {0}
nl: Standaard {0}

# LatestVersion
source: Latest {0}
nl: Nieuwste {0}

# Owner
source: Owner: {0}
nl: Eigenaar: {0}

# Created
source: Created: {0:g}
nl: Aangemaakt: {0:g}

# DownloadVersion
source: Download version {0}
nl: Versie {0} downloaden

# ExtractionFailed
source: Text could not be extracted from {0}. The original file is still included.
nl: Tekst kon niet worden geëxtraheerd uit {0}. Het originele bestand wordt wel meegestuurd.

# RejectedFiles
source: Could not add: {0}. Drop individual files, check file access and the 25 MB per-file limit. Other files were kept.
nl: Kon niet toevoegen: {0}. Sleep afzonderlijke bestanden en controleer de bestandstoegang en de limiet van 25 MB per bestand. Andere bestanden zijn behouden.

# AttachmentHttpError
source: The attachment server returned HTTP {0}. No credentials or automatic redirects were sent.
nl: De bijlageserver gaf HTTP {0} terug. Er zijn geen inloggegevens verzonden en omleidingen zijn niet automatisch gevolgd.

# ShowActivity
source: Show activity {0}: {1}
nl: Activiteit {0} tonen: {1}

# ShowSources
source: Show sources ({0})
nl: Bronnen tonen ({0})

# ShowAttachments
source: Show attachments ({0})
nl: Bijlagen tonen ({0})

# SourceHost
source: Sources from {0}
nl: Bronnen van {0}

# DownloadFile
source: Download {0}
nl: {0} downloaden

# ManagedExited
source: The managed {0} service exited (code {1}). Refresh the catalog to restart it.
nl: De beheerde {0}-service is gestopt (code {1}). Vernieuw de catalogus om deze opnieuw te starten.

# ManagedStartFailed
source: The managed {0} service could not be started.
nl: De beheerde {0}-service kon niet worden gestart.

# ManagedStartupFailed
source: The managed {0} service failed during startup (code {1}). Check the bundled runtime configuration.
nl: De beheerde {0}-service is mislukt tijdens het starten (code {1}). Controleer de meegeleverde runtimeconfiguratie.

# ManagedMissing
source: The managed {0} runtime is missing. Publish with the bundled runtimes or configure a remote gateway.
nl: De beheerde {0}-runtime ontbreekt. Publiceer met de meegeleverde runtimes of stel een externe gateway in.

# RestartRequired
source: Language saved. Restart the app to apply the new language.
nl: Taal opgeslagen. Start de app opnieuw om de nieuwe taal toe te passen.

# RestartHint
source: Language changes take effect after restarting the app.
nl: Taalwijzigingen worden toegepast nadat je de app opnieuw hebt gestart.

# StartupFailed
source: The app could not start. Check settings and local storage permissions.
nl: De app kon niet starten. Controleer de instellingen en de toegangsrechten voor lokale opslag.

source: Managed local
nl: Beheerd lokaal

source: Remote
nl: Extern
